package com.ads.logic.color;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

/**
 * Created by Administrator on 2014/6/24.
 */
public class Answer {
    public static final int GATE_MAX = 12;
    public final static int GRADE_1 = 1;
    public final static int GRADE_2 = 2;
    public final static int GRADE_3 = 3;
    public final static List<Integer[]> VALUES = new ArrayList<Integer[]>();
    public final static List<Integer[][]> CHALLENGES = new ArrayList<Integer[][]>();
    public final static String[] TITLES = new String[]{
            "时间已到!", "恭喜您过关了!", "您真牛!", "您真棒!"};
    public final static Map<Integer, String> quiz = new HashMap<Integer, String>();

    static {
        String V1 = "蓝色";
        String V2 = "棕色";
        String V3 = "白色";
        String V4 = "绿色";
        String V5 = "粉色";
        String V6 = "紫色";
        String V7 = "红色";
        String V8 = "黄色";
        String V9 = "橙色";
        quiz.put(170, V5 + "和" + V6 + ",\n" + V2 + "在一列.");
        quiz.put(180, V8 + "和" + V9 + "\n在一行.");
        quiz.put(190, V9 + "和" + V7 + ",\n" + V2 + "在一列.");
        quiz.put(191, V7 + "," + V6 + "在一行.");
        quiz.put(200, V5 + "和" + V9 + ",\n" + V4 + "在一行.");
        quiz.put(201, V8 + "," + V1 + "\n在一列.");
        quiz.put(210, V8 + "和" + V4 + ",\n" + V2 + "在一行.");
        quiz.put(220, V4 + "和" + V6 + ",\n" + V3 + "在一行.");
        quiz.put(221, V8 + "和" + V9 + "在\n一行.");
        quiz.put(230, V4 + "和" + V7 + "在\n一行.");
        quiz.put(231, V1 + "和" + V4 + ",\n" + V2 + "在一列.");
        quiz.put(240, V5 + "和" + V4 + "在\n一列.");
        quiz.put(250, V8 + "和" + V9 + ",\n" + V2 + "在一行.");
        quiz.put(251, V8 + "和" + V1 + ",\n" + V4 + "在一列.");
        quiz.put(252, V6 + "和" + V3 + ",\n" + V2 + "在一列.");
        quiz.put(260, V2 + "," + V4 + ","+ V5 +",\n" + V7 + "和" + V6 + "放在\n下面的阴影格里.");
        quiz.put(261, V9 + "和" + V5 + ",\n" + V2 + "在一行.");
        quiz.put(262, V7 + "和" + V1 + ",\n" + V2 + "在一列.");
        quiz.put(270, V1 + "," + V8 + "," + V6 + "\n和" + V5 + "不能靠\n在一起.");
        quiz.put(271, V3 + "和" + V4 + ",\n" + V2 + "在一行.");
        quiz.put(280, V1 + "和" + V4 + ",\n" + V2 + "在一列.");
        quiz.put(281, V8 + "和" + V1 + "在\n一行.");
        quiz.put(290, V3 + "不能和" + V8 + ",\n" + V6 + "," + V4 + "," + V2 + "\n," + V7 + "在一起.");
        quiz.put(291, V8 + "和" + V4 + ",\n" + V2 + "在一列.");
        quiz.put(300, V7 + "和" + V2 + "\n在一行.");
        quiz.put(310, "把" + V7 + "," + V1 + ",\n" + V6 + "和" + V4 + "\n填入阴影部分.");
        quiz.put(311, "把" + V7 + "," + V1 + ",\n" + V5 + "和" + V4 + "\n填入阴影部分.");
        quiz.put(312, "把" + V8 + "," + V5 + "\n和" + V4 + "\n填入阴影部分.");
        quiz.put(313, "把" + V7 + "," + V5 + ",\n" + V2 + "和" + V3 + "\n填入阴影部分.");
        quiz.put(314, "把" + V3 + "," + V9 + "\n和" + V8 + "\n填入阴影部分.");
        quiz.put(320, "把" + V3 + "," + V9 + ",\n" + V6 + "和" + V4 + "\n填入阴影部分.");
        quiz.put(321, "把" + V3 + "," + V7 + "\n和" + V5 + "填入\n阴影部分.");
        quiz.put(322, "把" + V1 + "," + V4 + "\n和" + V2 + "填入\n阴影部分.");
        quiz.put(323, "把" + V2 + "," + V7 + "\n和" + V6 + "填入\n阴影部分.");
        quiz.put(330, "把" + V1 + "," + V6 + ",\n" + V4 + "和" + V5 + "\n填入阴影部分.");
        quiz.put(331, "把" + V9 + "," + V1 + "," + V4 + ",\n" + V6 + "," + V7 + "和" + V3 + "\n填入阴影部分.");
        quiz.put(332, "把" + V4 + "," + V8 + ",\n" + V9 + "和" + V5 + "\n填入阴影部分.");
        quiz.put(333, "把" + V6 + "," + V3 + "\n和" + V2 + "填入\n阴影部分.");
        quiz.put(340, "把" + V9 + "," + V2 + ",\n" + V7 + "和" + V1 + "填\n入阴影部分.");
        quiz.put(341, "把" + V5 + "," + V4 + ",\n" + V3 + "和" + V2 + "填\n入阴影部分.");
        quiz.put(342, "把" + V6 + "," + V8 + ",\n" + V1 + "和" + V3 + "填\n入阴影部分.");
        quiz.put(343, "把" + V5 + "," + V3 + ",\n" + V8 + "和" + V7 + "填\n入阴影部分.");
        quiz.put(350, V9 + "," + V2 + "和\n" + V5 + "不要放在\n阴影部分.");
        quiz.put(351, V3 + "," + V6 + "," + V1 + "\n和" + V9 + "不要放\n在阴影部分.");
        quiz.put(352, V1 + "," + V2 + "和\n" + V8 + "不要放在\n阴影部分.");
        quiz.put(353, V3 + "," + V4 + "和\n" + V7 + "不要放在\n阴影部分.");
        quiz.put(354, V1 + "," + V7 + ",\n" + V5 + "不要放在\n阴影部分.");
        quiz.put(360, V1 + "," + V6 + "和\n" + V2 + "不要放在\n阴影部分.");
        quiz.put(361, V1 + "," + V2 + "和\n" + V5 + "不要放在\n阴影部分.");
        quiz.put(362, V1 + "," + V6 + "和\n" + V5 + "不要放在\n阴影部分.");
        quiz.put(363, "把" + V4 + "," + V8 + "\n和" + V3 + "填入\n阴影部分.");
        quiz.put(364, "把" + V7 + "," + V3 + "\n和" + V8 + "填入\n阴影部分.");
        quiz.put(365, "把" + V9 + "," + V7 + "\n和" + V8 + "填入\n阴影部分.");
        quiz.put(370, "把" + V3 + "," + V9 + ",\n" + V7 + "和" + V8 + "填\n入阴影部分.");
        quiz.put(371, "把" + V5 + "," + V1 + ",\n" + V8 + "和" + V3 + "填\n入阴影部分.");
        quiz.put(372, "把" + V8 + "," + V4 + ",\n" + V2 + "和" + V5 + "填\n入阴影部分.");
        quiz.put(373, "把" + V7 + "," + V6 + ",\n" + V4 + "和" + V8 + "填\n入阴影部分.");
        quiz.put(380, "把" + V6 + "," + V7 + ",\n" + V3 + "和" + V1 + "填\n入阴影部分.");
        quiz.put(381, "把" + V6 + "," + V3 + ",\n" + V9 + "和" + V1 + "填\n入阴影部分.");
        quiz.put(382, "把" + V4 + "," + V3 + ",\n" + V6 + "和" + V2 + "填\n入阴影部分.");
        quiz.put(383, "把" + V2 + "," + V8 + "\n和" + V6 + "填入\n阴影部分.");
        quiz.put(390, "把" + V8 + "," + V7 + "\n和" + V9 + "填入\n阴影部分.");
        quiz.put(391, "把" + V2 + "," + V3 + "\n和" + V1 + "填入\n阴影部分.");
        quiz.put(392, "把" + V6 + "," + V3 + "\n和" + V9 + "填入\n阴影部分.");
        quiz.put(393, "把" + V7 + "," + V4 + "\n和" + V1 + "填入\n阴影部分.");
        quiz.put(394, V5 + "放在九宫\n格的中间.");
        quiz.put(400, "把" + V2 + "," + V9 + "\n和" + V8 + "填入\n阴影部分.");
        quiz.put(401, "把" + V8 + "," + V6 + "\n和" + V1 + "填入\n阴影部分.");
        quiz.put(402, "把" + V7 + "," + V9 + "\n和" + V5 + "填入\n阴影部分.");
        quiz.put(403, "把" + V7 + "和\n" + V4 + "填入\n阴影部分.");
        quiz.put(410, V5 + "和" + V7 + ",\n" + V3 + "在一行.");
        quiz.put(411, V8 + "和" + V2 + ",\n" + V5 + "在一列.");
        quiz.put(420, V4 + "," + V5 + ",\n"+V3+ "," + V6 + "和" + V1 + "\n都放在下面所\n示的对角线上.");
        quiz.put(421, V2 + "和" + V6 + ",\n" + V3 + "在一行.");
        quiz.put(430, V7 + "和" + V8 + ",\n" + V4 + "在一列.");
        quiz.put(431, V3 + "和" + V7 + ",\n" + V1 + "在一行.");
        quiz.put(440, V1 + "," + V6 + ",\n"+V2+"," + V8 + "和" + V3 + "\n排成T形.");
        quiz.put(441, V3 + "和" + V7 + ",\n" + V5 + "在一行.");
        quiz.put(450, V6 + "," + V9 + "和\n" + V7 + "放在一条斜\n线上.");
        quiz.put(451, V5 + "和" + V3 + ",\n" + V8 + "在一列.");
        quiz.put(452, V6 + "不能和\n" + V7 + "放在一列.");
        quiz.put(460, V5 + "在" + V8 + "上\n面,也在" + V4 + "的\n右边.");
        quiz.put(461, V2 + "在" + V1 + "右\n边,也在" + V8 + "的\n上面.");
        quiz.put(462, V8 + "在" + V9 + "\n左边.");
        quiz.put(463, V4 + "在" + V6 + "\n左边.");
        quiz.put(464, V1 + "在" + V7 + "和\n" + V4 + "上面.");
        quiz.put(465, V3 + "在" + V6 + "\n上面.");
        quiz.put(470, V3 + "在" + V6 + "\n下面.");
        quiz.put(471, V6 + "在" + V8 + "\n左边.");
        quiz.put(472, V4 + "在" + V7 + "和\n" + V9 + "上面.");
        quiz.put(473, V1 + "在" + V6 + "下\n面,也在" + V2 + "的\n左边.");
        quiz.put(474, V9 + "在" + V7 + "上\n面,也在" + V5 + "的\n右边.");
        quiz.put(480, V4 + "在" + V2 + "的左边.");
        quiz.put(481, V9 + "在" + V8 + "左\n边,也在" + V1 + "的\n右边.");
        quiz.put(482, V3 + "在" + V5 + "的\n右边.");
        quiz.put(483, V8 + "在" + V2 + "和\n" + V6 + "的上面.");
        quiz.put(484, V5 + "在" + V7 + "下\n面," + V7 + "在" + V2 + "\n的左边.");
        quiz.put(490, V6 + "在" + V4 + "的\n右边.");
        quiz.put(491, V3 + "在" + V9 + "的\n右边.");
        quiz.put(492, V9 + "在" + V7 + "的\n上面," + V7 + "在\n" + V5 +"的左边.");
        quiz.put(493, V2 + "在" + V1 + "的\n上面.");
        quiz.put(494, V1 + "在" + V9 + "的\n左边.");
        quiz.put(500, V4 + "在" + V5 + "的\n下面.");
        quiz.put(501, V5 + "在" + V9 + "的\n右边,也在" + V8 + "\n的上面.");
        quiz.put(502, V8 + "在" + V1 + "的\n左边.");
        quiz.put(503, V1 + "在" + V7 + "的\n下面,也在" + V3 + "\n的上面.");
        quiz.put(504, V3 + "在" + V2 + "的\n右边.");
        quiz.put(510, V5 + "在" + V8 + "和\n" + V2 + "的上面.");
        quiz.put(511, V7 + "在" + V6 + "的\n上面,也在" + V9 + "\n的下面.");
        quiz.put(512, V4 + "在" + V7 + "和\n" + V8 + "的左边.");
        quiz.put(513, V2 + "在" + V6 + "和\n" + V3 + "的中间.");
        quiz.put(520, V6 + "," + V4 + "和\n" + V1 + "的第三行.");
        quiz.put(521, V5 + "," + V3 + "和\n" + V7 + "在第一行.");
        quiz.put(522, V4 + "," + V9 + "和\n" + V3 + "在第一列.");
        quiz.put(523, V7 + "," + V6 + "和\n" + V2 + "在第二列.");
        quiz.put(530, V2 + "," + V3 + "和\n" + V9 + "的第二行.");
        quiz.put(531, V5 + "," + V8 + "和\n" + V4 + "在第三行.");
        quiz.put(532, V3 + "," + V5 + "和\n" + V1 + "在第二列.");
        quiz.put(533, V8 + "," + V6 + "和\n" + V2 + "在第三列.");
        quiz.put(540, V3 + "," + V8 + "和\n" + V5 + "的第一行.");
        quiz.put(541, V9 + "," + V7 + "和\n" + V1 + "在第二行.");
        quiz.put(542, V9 + "在" + V4 + "的\n上面,也在" + V5 + "\n的下面.");
        quiz.put(543, V8 + "在" + V6 + "和\n" + V7 + "的上面.");
        quiz.put(544, V4 + "," + V6 + "之间有\n一个间隔," + V4 + "在\n" + V6 + "的左边.");
        quiz.put(550, V4 + "," + V1 + "和\n" + V3 + "在第二列.");
        quiz.put(551, V8 + "," + V5 + "和\n" + V7 + "在第三列.");
        quiz.put(552, V6 + "在" + V1 + "和\n" + V7 + "的左边.");
        quiz.put(553, V2 + "在" + V6 + "的\n下面,也在" + V9 + "\n的上面.");
        quiz.put(554, V9 + "在" + V3 + "和\n" + V5 + "的左边.");
        quiz.put(560, V3 + "紧靠在\n" + V9 + "的左边.");
        quiz.put(561, V5 + "紧靠在\n" + V2 + "的右边.");
        quiz.put(562, V4 + "紧靠在\n" + V1 + "的上面.");
        quiz.put(563, V7 + "紧靠在\n" + V6 + "的下面.");
        quiz.put(564, V4 + "紧靠在\n" + V8 + "的右边.");
        quiz.put(565, V3 + "紧靠在\n" + V8 + "的上面.");
        quiz.put(570, V2 + "紧靠在" + V9 + "\n的左边," + V2 + "\n在第二行.");
        quiz.put(571, V1 + "紧靠在\n" + V3 + "的左边.");
        quiz.put(572, V6 + "紧靠在\n" + V8 + "的右边.");
        quiz.put(573, V5 + "紧靠在\n" + V7 + "的上面.");
        quiz.put(574, V9 + "," + V6 + "和\n" + V1 + "在一列.");
        quiz.put(575, V2 + "在" + V5 + "的\n左边.");
        quiz.put(580, "将以下六组颜色放入九宫格中,无论横着竖着都在\n一行或一列,其中" + V8 + "一定在第一列." +
                "\n 1  " + V7 + "," + V9 + "," + V5 + "\n 2  " + V6 + "," + V4 + "," + V3 + "\n 3  " + V2 + "," + V9 + "," + V4 + "\n 4  " + V1 + "," + V5 +"," + V3 + "\n 5  " + V8 + "," + V7 + "," + V6 + "\n 6  " + V8 + "," + V2 +"," + V1);
        quiz.put(590, "将以下五组颜色放入九宫格中,无论横着竖着都在\n一行或一列." +
                "\n 1  " + V1 + "," + V9 + "," + V6 + "\n 2  " + V8 + ","+V6+"," + V7 + "\n 3  " + V4 + "," + V1 + "," + V3 + "\n 4  " + V3 + "," + V5 + "," + V7 + "\n 5  " + V4 + "," + V2 + "," + V8);
        quiz.put(600, "将以下四组颜色放入九宫格中,无论横着竖着都在\n一行或一列." +
                "\n 1  " + V6 + "," + V8 + "," + V1 + "\n 2  " + V7 + "," + V1 + "," + V3 + "\n 3  " + V9 + "," + V6+"," + V2 + "\n 4  "+V2+"," + V4 + "," + V3);
    }


    private final static Integer[] VALUE1 =//答案1
            {1, 2, 3, 4, 5, 6, 7, 8, 9};
    private final static Integer[] VALUE2 =//答案2
            {5, 3, 9, 7, 2, 6, 4, 1, 8};
    private final static Integer[] VALUE3 =//答案3
            {6, 7, 3, 2, 4, 5, 8, 1, 9};
    private final static Integer[] VALUE4 =//答案4
            {5, 6, 9, 4, 8, 3, 1, 7, 2};
    private final static Integer[] VALUE5 =//答案4
            {3, 6, 4, 8, 7, 1, 9, 5, 2};
    private final static Integer[] VALUE6 =//答案4
            {9, 3, 8, 4, 6, 1, 2, 5, 7};
    private final static Integer[] VALUE7 =//答案4
            {1, 2, 5, 8, 3, 6, 7, 9, 4};
    private final static Integer[] VALUE8 =//答案4
            {8, 4, 2, 9, 5, 6, 1, 3, 7};
    private final static Integer[] VALUE9 =//答案4
            {4, 3, 8, 5, 7, 9, 2, 6, 1};
    private final static Integer[] VALUE10 =//答案4
            {7, 4, 8, 9, 6, 5, 2, 3, 1};
    private final static Integer[] VALUE11 =//答案4
            {1, 8, 3, 2, 4, 9, 7, 5, 6};
    private final static Integer[] VALUE12 =//答案4
            {3, 4, 2, 9, 8, 5, 7, 1, 6};
    private final static Integer[] VALUE13 =//答案13
            {4, 2, 9, 8, 6, 5, 7, 1, 3};
    private final static Integer[] VALUE14 =//答案14
            {6, 5, 7, 8, 3, 1, 9, 2, 4};
    private final static Integer[] VALUE15 =
            {8, 6, 5, 3, 2, 7, 1, 9, 4};
    private final static Integer[] VALUE16 =
            {6, 5, 1, 4, 3, 2, 7, 8, 9};
    private final static Integer[] VALUE17 =
            {4, 8, 5, 3, 7, 6, 1, 9, 2};
    private final static Integer[] VALUE18 =
            {8, 9, 4, 6, 5, 3, 1, 2, 7};
    private final static Integer[] VALUE19 =
            {5, 8, 9, 4, 1, 2, 6, 3, 7};
    private final static Integer[] VALUE20 =
            {9, 5, 4, 2, 7, 8, 3, 6, 1};
    private final static Integer[] VALUE21 =
            {7, 5, 9, 3, 1, 6, 8, 4, 2};
    private final static Integer[] VALUE22 =
            {3, 6, 4, 7, 1, 5, 9, 2, 8};
    private final static Integer[] VALUE23 =
            {7, 3, 4, 6, 9, 2, 8, 5, 1};
    private final static Integer[] VALUE24 =
            {2, 1, 5, 9, 7, 4, 8, 3, 6};
    private final static Integer[] VALUE25 =
            {5, 4, 3, 7, 1, 6, 9, 8, 2};
    private final static Integer[] VALUE26 =
            {2, 9, 5, 7, 3, 6, 1, 4, 8};
    private final static Integer[] VALUE27 =
            {8, 9, 6, 4, 2, 3, 1, 7, 5};
    private final static Integer[] VALUE28 =
            {8, 1, 6, 5, 2, 9, 3, 4, 7};
    private final static Integer[] VALUE29 =
            {8, 5, 3, 4, 1, 9, 2, 6, 7};
    private final static Integer[] VALUE30 =
            {6, 5, 3, 2, 4, 7, 9, 1, 8};
    private final static Integer[] VALUE31 =
            {7, 1, 6, 4, 5, 8, 3, 2, 9};
    private final static Integer[] VALUE32 =
            {6, 9, 3, 8, 5, 4, 7, 1, 2};
    private final static Integer[] VALUE33 =
            {6, 1, 4, 9, 8, 5, 7, 2, 3};
    private final static Integer[] VALUE34 =
            {1, 9, 6, 7, 2, 4, 8, 5, 3};
    private final static Integer[] VALUE35 =
            {9, 7, 5, 3, 2, 6, 4, 8, 1};
    private final static Integer[] VALUE36 =
            {3, 5, 7, 2, 8, 1, 4, 6, 9};
    private final static Integer[] VALUE37 =
            {6, 3, 9, 7, 8, 5, 2, 4, 1};
    private final static Integer[] VALUE38 =
            {4, 3, 7, 2, 6, 8, 9, 1, 5};
    private final static Integer[] VALUE39 =
            {1, 2, 3, 4, 5, 6, 7, 8, 9};
    private final static Integer[] VALUE40 =
            {9, 5, 7, 6, 8, 1, 2, 4, 3};
    private final static Integer[] VALUE41 =
            {1, 4, 8, 7, 3, 5, 9, 6, 2};
    private final static Integer[] VALUE42 =
            {1, 7, 4, 8, 5, 9, 6, 2, 3};
    private final static Integer[] VALUE43 =
            {8, 6, 9, 4, 2, 5, 7, 1, 3};
    private final static Integer[] VALUE44 =
            {6, 1, 8, 9, 2, 4, 7, 3, 5};
    private final static Integer[] VALUE45 =
            {6, 1, 3, 4, 9, 8, 2, 7, 5};
    private final static Integer[] VALUE46 =
            {1, 2, 3, 4, 5, 6, 7, 8, 9};
    private final static Integer[] VALUE47 =
            {6, 8, 4, 3, 5, 9, 1, 2, 7};
    private final static Integer[] VALUE48 =
            {1, 9, 8, 7, 4, 2, 5, 3, 6};
    private final static Integer[] VALUE49 =
            {2, 4, 6, 1, 9, 3, 8, 7, 5};
    private final static Integer[] VALUE50 =
            {9, 5, 7, 6, 8, 1, 2, 4, 3};
    private final static Integer[] VALUE51 =
            {1, 5, 9, 4, 8, 7, 3, 2, 6};
    private final static Integer[] VALUE52 =
            {3, 7, 5, 9, 2, 8, 4, 6, 1};
    private final static Integer[] VALUE53 =
            {7, 1, 6, 9, 3, 2, 4, 5, 8};
    private final static Integer[] VALUE54 =
            {5, 3, 8, 9, 1, 7, 4, 2, 6};
    private final static Integer[] VALUE55 =
            {6, 1, 7, 9, 3, 5, 2, 4, 8};
    private final static Integer[] VALUE56 =
            {6, 3, 9, 7, 8, 4, 2, 5, 1};
    private final static Integer[] VALUE57 =
            {4, 1, 3, 2, 9, 5, 8, 6, 7};
    private final static Integer[] VALUE58 =
            {8, 2, 1, 6, 4, 3, 7, 9, 5};
    private final static Integer[] VALUE59 =
            {2, 9, 5, 4, 1, 3, 8, 6, 7};
    private final static Integer[] VALUE60 =
            {8, 5, 4, 6, 9, 2, 1, 7, 3};
    static {
        VALUES.add(VALUE1);
        VALUES.add(VALUE2);
        VALUES.add(VALUE3);
        VALUES.add(VALUE4);
        VALUES.add(VALUE5);
        VALUES.add(VALUE6);
        VALUES.add(VALUE7);
        VALUES.add(VALUE8);
        VALUES.add(VALUE9);
        VALUES.add(VALUE10);
        VALUES.add(VALUE11);
        VALUES.add(VALUE12);
        VALUES.add(VALUE13);
        VALUES.add(VALUE14);
        VALUES.add(VALUE15);
        VALUES.add(VALUE16);
        VALUES.add(VALUE17);
        VALUES.add(VALUE18);
        VALUES.add(VALUE19);
        VALUES.add(VALUE20);
        VALUES.add(VALUE21);
        VALUES.add(VALUE22);
        VALUES.add(VALUE23);
        VALUES.add(VALUE24);
        VALUES.add(VALUE25);
        VALUES.add(VALUE26);
        VALUES.add(VALUE27);
        VALUES.add(VALUE28);
        VALUES.add(VALUE29);
        VALUES.add(VALUE30);
        VALUES.add(VALUE31);
        VALUES.add(VALUE32);
        VALUES.add(VALUE33);
        VALUES.add(VALUE34);
        VALUES.add(VALUE35);
        VALUES.add(VALUE36);
        VALUES.add(VALUE37);
        VALUES.add(VALUE38);
        VALUES.add(VALUE39);
        VALUES.add(VALUE40);
        VALUES.add(VALUE41);
        VALUES.add(VALUE42);
        VALUES.add(VALUE43);
        VALUES.add(VALUE44);
        VALUES.add(VALUE45);
        VALUES.add(VALUE46);
        VALUES.add(VALUE47);
        VALUES.add(VALUE48);
        VALUES.add(VALUE49);
        VALUES.add(VALUE50);
        VALUES.add(VALUE51);
        VALUES.add(VALUE52);
        VALUES.add(VALUE53);
        VALUES.add(VALUE54);
        VALUES.add(VALUE55);
        VALUES.add(VALUE56);
        VALUES.add(VALUE57);
        VALUES.add(VALUE58);
        VALUES.add(VALUE59);
        VALUES.add(VALUE60);
    }

    private final static Integer[][] CHALLENGE1 = {
            {1, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 2, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 3, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 4, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 5, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 6, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 7, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 8, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 9}
    };
    private final static Integer[][] CHALLENGE2 = {
            {0, 0, 0, 0, 0, 0, 0, 1, 0},
            {5, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 7, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 8},
            {0, 0, 9, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 6, 0, 0, 0},
            {0, 3, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 2, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 4, 0, 0}
    };
    private final static Integer[][] CHALLENGE3 = {
            {0, 0, 0, 0, 0, 0, 0, 0, 9},
            {0, 0, 0, 0, 0, -3, 0, 0, 0},
            {0, 7, 0, 0, 0, 0, 0, 0, 0},
            {6, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 2, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 8, 0, 0},
            {0, 0, 0, 0, 4, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 1, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, -5}
    };
    private final static Integer[][] CHALLENGE4 = {
            {0, 0, 0, 0, 8, 0, 0, 0, 9},
            {0, 0, -2, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 3, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 1, 0, 0},
            {0, 0, 0, 0, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 5, 0, 0, 0},
            {0, 0, 0, 4, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 7, 0}
    };
    private final static Integer[][] CHALLENGE5 = {
            {0, 0, 0, 0, 7, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 5, 0},
            {0, 0, 0, -1, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 9, 0, 0},
            {0, 6, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -8, 0, 0, 0},
            {0, 0, 0, -2, 0, -2, 0, 0, 0},
            {3, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 4, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE6 = {
            {0, 3, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 4, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, -2, -2},
            {0, 0, 0, 0, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, -7, 0, 0},
            {0, 0, 0, 0, 0, 1, 0, 0, 0},
            {0, 0, 8, 0, 0, 0, 0, 0, 0},
            {9, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, -5}
    };
    private final static Integer[][] CHALLENGE7 = {
            {1, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -6, 0, -6, -6, 0, 0, 0, 0},
            {0, 0, 5, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, -2, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 9, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 4},
            {0, -8, 0, 0, -8, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 7, 0, 0}
    };
    private final static Integer[][] CHALLENGE8 = {
            {0, 0, 0, 0, 0, 0, 0, 0, 7},
            {8, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -4, 0, 0, -4, 0, 0, 0},
            {9, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 5, 0, 0, 0, 0},
            {0, 0, -6, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -2, 0, 0, 0},
            {0, -1, -1, 0, 0, -1, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 3, 0}
    };
    private final static Integer[][] CHALLENGE9 = {
            {-8, 0, 0, 0, 0, 0, -8, 0, -8},
            {0, 0, 0, 0, 0, 0, 0, 0, -2},
            {0, 3, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 4, 0, 4},
            {0, 0, 0, 0, 0, 0, 0, 6, 0},
            {0, 0, 0, 0, 0, 9, 0, 0, 0},
            {0, 0, 0, 0, 7, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, -1, 0, 0},
            {0, 0, 0, 5, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE10 = {
            {0, 0, 0, 0, 0, 5, 0, 0, 0},
            {0, 0, -1, 0, 0, 0, -1, -1, 0},
            {0, 4, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 9, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, -2, -2},
            {0, 0, 0, 0, 0, 0, -8, -8, 0},
            {0, 0, -3, 0, 0, 0, -3, 0, 0},
            {7, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE11 = {
            {0, -7, 0, -7, 0, -7, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 6},
            {0, -9, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 4, 0, 0, 0, 0},
            {0, -2, 0, 0, 0, -2, 0, 0, 0},
            {1, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 3, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 5, 0}
    };
    private final static Integer[][] CHALLENGE12 = {
            {0, 0, 0, 0, 0, 0, 0, 1, 0},
            {0, 0, -5, 0, -5, 0, -5, 0, 0},
            {0, 4, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -8, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 9, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 6},
            {0, 0, -3, 0, -3, -3, -3, 0, 0},
            {0, 0, -7, 0, -7, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE13 = {
            {0, 0, 0, 0, 0, 0, 7, 0, 0},
            {0, 0, -2, 0, 0, -2, 0, 0, 0},
            {0, 0, 0, 8, 0, 0, 0, 0, 0},
            {0, -3, -3, 0, 0, -3, 0, 0, 0},
            {4, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 6, 0, 0, 0, 0},
            {0, -1, -1, 0, 0, -1, 0, 0, -1},
            {0, 0, -5, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE14 = {
            {0, -4, -4, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 2, 0},
            {0, 0, -5, 0, 0, 0, 0, 0, 0},
            {0, -8, -8, 0, -8, 0, 0, 0, -8},
            {0, 0, 0, 0, 0, 1, 0, 0, 0},
            {0, -3, -3, 0, 0, 0, 0, 0, -3},
            {0, 0, 0, 0, 0, 0, 9, 0, 0},
            {6, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE15 = {
            {0, 6, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 4},
            {-5, 0, 0, -5, -5, -5, 0, -5, 0},
            {-2, 0, 0, -2, 0, -2, 0, -2, 0},
            {0, 0, 0, 0, 0, -3, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 1, 0, 0},
            {0, 0, 0, -8, 0, -8, 0, -8, 0},
            {0, 0, 0, -9, 0, -9, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE16 = {
            {-4, 0, -4, 0, 0, -4, 0, 0, -4},
            {0, 5, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -6, 0, 0, -6, 0, 0, -6},
            {0, 0, 0, 0, 3, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -1, 0, 0, -1},
            {0, 0, 0, 0, 0, 0, 0, 8, 0},
            {-7, 0, -7, -7, 0, -7, 0, 0, -7},
            {0, 0, 0, 0, 0, 0, 0, 0, -2}
    };
    private final static Integer[][] CHALLENGE17 = {
            {4, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -8, 0, 0, -8, -8, 0},
            {0, 0, 0, 0, 0, 0, 0, -1, 0},
            {170, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 7, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 2},
            {0, 0, -6, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, -3, -3, 0}
    };
    private final static Integer[][] CHALLENGE18 = {
            {0, 0, -8, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -5, 0, -5, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 7},
            {0, 0, 0, 0, 0, 0, 1, 0, 0},
            {-9, 0, -9, -9, -9, -9, 0, 0, 0},
            {0, 0, 0, -3, -3, 0, 0, 0, 0},
            {0, 0, 0, -4, -4, -4, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 2, 0},
            {180, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE19 = {
            {190, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -5, 0, 0, 0, 0, 0, -5, 0},
            {0, -3, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 1, 0, 0, 0, 0},
            {0, 0, 0, 4, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 2, 0, 0, 0},
            {191, 0, 0, 0, 0, 0, 0, 0, 0},
            {-6, -6, 0, 0, 0, 0, 0, -6, 0}
    };
    private final static Integer[][] CHALLENGE20 = {
            {0, 0, 0, -3, -3, 0, 0, 0, 0},
            {200, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -8, -8, 0, -8, 0, 0},
            {9, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 4, 0, 0, 0, 0, 0, 0},
            {201, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -1, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 6, 0},
            {0, 0, 0, -7, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE21 = {
            {7, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 5, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 9, 0, 0, 0, 0, 0, 0},
            {210, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -4, -4, -4, -4, 0, 0},
            {0, 0, 0, -6, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, -2, -2, 0},
            {0, 0, 0, -1, 0, -1, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE22 = {
            {0, 0, 4, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, -9, -9, 0, 0, -9},
            {0, 0, 0, 0, 0, 0, 0, 2, 0},
            {0, 0, 0, 0, -5, 0, 0, 0, 0},
            {220, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 7, 0, 0, 0, 0, 0},
            {221, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -3, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE23 = {
            {230, 0, 0, 0, 0, 0, 0, 0, 0},
            {7, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -9, 0, 0, 0, 0, 0, -9, 0},
            {231, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -1, 0, 0, -1, -1, 0, -1, 0},
            {0, 0, 0, 6, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 8, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, -3, 0}
    };
    private final static Integer[][] CHALLENGE24 = {
            {0, -7, 0, -7, 0, 0, 0, 0, 0},
            {0, -3, -3, -3, -3, -3, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 6},
            {2, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -1, 0, 0, 0, 0, 0},
            {240, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -5, 0, 0, -5, -5, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 8, 0, 0}
    };
    private final static Integer[][] CHALLENGE25 = {
            {0, 0, 0, 0, 1, 0, 0, 0, 0},
            {250, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -5, -5, 0, -5, 0, 0, 0},
            {251, 0, 0, 0, 0, 0, 0, 0, 0},
            {-3, 0, 0, -3, 0, -3, 0, 0, 0},
            {252, 0, 0, 0, 0, 0, 0, 0, 0},
            {-2, -2, -2, -2, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE26 = {
            {260, 0, 0, 0, 0, 0, 0, 0, 0},
            {261, 0, 0, 0, 0, 0, 0, 0, 0},
            {262, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 10, 10, 0, 10, 0, 10, 0},
            {0, -8, 0, 0, -8, 0, 0, 0, 0},
            {0, -3, 0, 0, 0, 0, 0, 0, 0},
            {0, -1, 0, 0, -1, 0, 0, 0, -1},
            {0, 0, 0, 0, 0, 0, 0, -6, 0}
    };
    private final static Integer[][] CHALLENGE27 = {
            {270, 0, 0, 0, 0, 0, 0, 0, 0},
            {271, 0, 0, 0, 0, 0, 0, 0, 0},
            {-1, 0, -1, 0, 0, 0, 0, 0, -1},
            {0, 9, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -2, 0, -2, 0, 0, 0},
            {0, 0, -8, 0, 0, 0, 0, 0, -8},
            {0, 0, 0, 0, 0, 0, 0, 7, 0},
            {0, 0, 0, -3, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, -6}
    };
    private final static Integer[][] CHALLENGE28 = {
            {0, 0, 0, 0, 0, -8, 0, -8, -8},
            {0, 0, 0, 0, 0, -5, 0, 0, -5},
            {0, 0, 0, 0, 0, 0, 3, 0, 0},
            {0, 0, 6, 0, 0, 0, 0, 0, 0},
            {280, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -7, 0, 0, 0},
            {0, 0, 0, 0, -4, 0, 0, 0, 0},
            {0, 0, 0, 0, -1, 0, 0, 0, 0},
            {281, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE29 = {
            {290, 0, 0, 0, 0, 0, 0, 0, 0},
            {291, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 9, 0, 0, 0},
            {0, 0, 0, 0, 1, 0, 0, 0, 0},
            {0, -7, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, -2, 0, 0, 0, 0, 0},
            {0, 0, 0, -8, 0, 0, -8, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 6, 0}
    };
    private final static Integer[][] CHALLENGE30 = {
            {0, 0, 0, -6, 0, -6, 0, -6, 0},
            {0, 0, 0, 0, 0, 0, 9, 0, 0},
            {0, 0, 0, -7, 0, 0, 0, 0, 0},
            {300, 0, 0, 0, 0, 0, 0, 0, 0},
            {-4, 0, -4, -4, 0, -4, 0, -4, 0},
            {-3, 0, 0, 0, 0, 0, 0, -3, 0},
            {0, 5, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 8}
    };
    private final static Integer[][] CHALLENGE31 = {
            {310, 0, 0, 0, 0, 0, 0, 0, 0},
            {311, 0, 0, 0, 0, 0, 0, 0, 0},
            {312, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 10, 10, 10, 10, 0, 0, 0, 0},
            {10, 10, 0, 10, 10, 0, 0, 0, 0},
            {0, 0, 0, 10, 10, 10, 0, 0, 0},
            {313, 0, 0, 0, 0, 0, 0, 0, 0},
            {314, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 0, 10, 0, 10, 10, 0},
            {0, 0, 0, 0, 0, 10, 10, 0, 10},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE32 = {
            {320, 0, 0, 0, 0, 0, 0, 0, 0},
            {321, 0, 0, 0, 0, 0, 0, 0, 0},
            {322, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 10, 10, 0, 0, 10, 0, 0, 0},
            {0, 0, 10, 0, 10, 0, 10, 0, 0},
            {0, 0, 0, 0, 0, 10, 0, 10, 10},
            {323, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 0, 0, 0, 10, 0, 10},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE33 = {
            {330, 0, 0, 0, 0, 0, 0, 0, 0},
            {331, 0, 0, 0, 0, 0, 0, 0, 0},
            {332, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 10, 10, 0, 0, 10, 0, 0, 0},
            {10, 10, 10, 10, 0, 0, 10, 0, 10},
            {0, 0, 10, 10, 10, 10, 0, 0, 0},
            {333, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 0, 0, 0, 0, 10, 10},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE34 = {
            {340, 0, 0, 0, 0, 0, 0, 0, 0},
            {341, 0, 0, 0, 0, 0, 0, 0, 0},
            {342, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 10, 0, 10, 10, 0, 0, 0, 0},
            {0, 0, 0, 0, 10, 10, 0, 10, 10},
            {10, 0, 10, 0, 0, 0, 10, 0, 10},
            {343, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 10, 0, 0, 10, 10, 10},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE35 = {
            {350, 0, 0, 0, 0, 0, 0, 0, 0},
            {351, 0, 0, 0, 0, 0, 0, 0, 0},
            {352, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 10, 0, 10, 0, 10, 10, 10, 10},
            {0, 10, 10, 0, 10, 0, 10, 10, 0},
            {10, 10, 10, 10, 0, 10, 10, 0, 0},
            {353, 0, 0, 0, 0, 0, 0, 0, 0},
            {354, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 10, 0, 10, 10, 0, 10, 10},
            {10, 0, 0, 10, 10, 10, 10, 10, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE36 = {
            {360, 0, 0, 0, 0, 0, 0, 0, 0},
            {361, 0, 0, 0, 0, 0, 0, 0, 0},
            {362, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 10, 10, 0, 10, 0, 10, 0, 10},
            {10, 0, 10, 0, 10, 0, 10, 10, 10},
            {10, 0, 10, 10, 10, 0, 10, 0, 10},
            {363, 0, 0, 0, 0, 0, 0, 0, 0},
            {364, 0, 0, 0, 0, 0, 0, 0, 0},
            {365, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 0, 10, 0, 10, 0, 0},
            {10, 0, 10, 0, 10, 0, 0, 0, 0},
            {0, 0, 10, 0, 10, 0, 0, 0, 10}
    };
    private final static Integer[][] CHALLENGE37 = {
            {370, 0, 0, 0, 0, 0, 0, 0, 0},
            {371, 0, 0, 0, 0, 0, 0, 0, 0},
            {372, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 10, 10, 10, 10, 0, 0, 0, 0},
            {0, 10, 0, 0, 10, 10, 0, 0, 10},
            {0, 0, 0, 0, 10, 10, 10, 10, 0},
            {373, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 10, 10, 0, 0, 10, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE38 = {
            {380, 0, 0, 0, 0, 0, 0, 0, 0},
            {381, 0, 0, 0, 0, 0, 0, 0, 0},
            {382, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 10, 10, 0, 10, 0, 0, 10, 0},
            {0, 10, 0, 0, 10, 0, 10, 10, 0},
            {10, 10, 0, 10, 10, 0, 0, 0, 0},
            {383, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 10, 10, 10, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE39 = {
            {390, 0, 0, 0, 0, 0, 0, 0, 0},
            {391, 0, 0, 0, 0, 0, 0, 0, 0},
            {392, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 10, 10, 10},
            {10, 10, 10, 0, 0, 0, 0, 0, 0},
            {0, 0, 10, 0, 0, 10, 0, 0, 10},
            {393, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 10, 0, 0, 10, 0, 0},
            {394, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE40 = {
            {400, 0, 0, 0, 0, 0, 0, 0, 0},
            {401, 0, 0, 0, 0, 0, 0, 0, 0},
            {402, 0, 0, 0, 0, 0, 0, 0, 0},
            {10, 0, 0, 0, 10, 0, 10, 0, 0},
            {0, 0, 0, 10, 10, 10, 0, 0, 0},
            {10, 10, 10, 0, 0, 0, 0, 0, 0},
            {403, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 10, 0, 0, 0, 0, 10, 0},
            {0, -6, -6, 0, 0, -6, 0, -6, -6},
            {0, 0, 0, 0, 0, 0, 0, 0, 0},
    };
    private final static Integer[][] CHALLENGE41 = {
            {0, 0, -5, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 9, 0, 0},
            {-4, 0, 0, 0, 0, 0, 0, 0, 0},
            {410, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, -7, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 6, 0},
            {411, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -2, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE42 = {
            {420, 0, 0, 0, 0, 0, 0, 0, 0},
            {421, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, -1, 0, 0, 0, 0},
            {10, 0, 10, 0, 10, 0, 10, 0, 10},
            {0, 0, 0, 0, 0, 9, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, 0, -6},
            {0, 0, 4, 0, 0, 0, 0, 0, 0},
            {0, 0, -2, 0, 0, 0, 0, 0, 0},
            {0, -8, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE43 = {
            {430, 0, 0, 0, 0, 0, 0, 0, 0},
            {431, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, 9, 0, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 2, 0, 0, 0, 0},
            {0, 0, 0, -8, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 0, -3, 0},
            {0, 0, 0, 0, 0, -6, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE44 = {
            {440, 0, 0, 0, 0, 0, 0, 0, 0},
            {441, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, 0, -1, 0, -1, 0, 0, 0, 0},
            {10, 10, 10, 0, 10, 0, 0, 10, 0},
            {0, 0, 0, 0, -8, 0, 0, 0, 0},
            {0, 0, 0, -5, 0, -5, -5, 0, 0},
            {0, -6, -6, 0, -6, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, -9, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE45 = {
            {450, 0, 0, 0, 0, 0, 0, 0, 0},
            {451, 0, 0, 0, 0, 0, 0, 0, 0},
            {452, 0, 0, 0, 0, 0, 0, 0, 0},
            {0, -7, 0, -7, 0, 0, 0, 0, 0},
            {0, 0, 0, 0, 0, 0, 2, 0, 0},
            {0, 0, 0, 4, 0, 0, 0, 0, 0},
            {0, 0, 3, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE46 = {
            {460, 0, 0, 0, 0, 0, 0, 0, 0},
            {461, 0, 0, 0, 0, 0, 0, 0, 0},
            {462, 0, 0, 0, 0, 0, 0, 0, 0},
            {463, 0, 0, 0, 0, 0, 0, 0, 0},
            {464, 0, 0, 0, 0, 0, 0, 0, 0},
            {465, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE47 = {
            {470, 0, 0, 0, 0, 0, 0, 0, 0},
            {471, 0, 0, 0, 0, 0, 0, 0, 0},
            {472, 0, 0, 0, 0, 0, 0, 0, 0},
            {473, 0, 0, 0, 0, 0, 0, 0, 0},
            {474, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE48 = {
            {480, 0, 0, 0, 0, 0, 0, 0, 0},
            {481, 0, 0, 0, 0, 0, 0, 0, 0},
            {482, 0, 0, 0, 0, 0, 0, 0, 0},
            {483, 0, 0, 0, 0, 0, 0, 0, 0},
            {484, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE49 = {
            {490, 0, 0, 0, 0, 0, 0, 0, 0},
            {491, 0, 0, 0, 0, 0, 0, 0, 0},
            {492, 0, 0, 0, 0, 0, 0, 0, 0},
            {493, 0, 0, 0, 0, 0, 0, 0, 0},
            {494, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE50 = {
            {500, 0, 0, 0, 0, 0, 0, 0, 0},
            {501, 0, 0, 0, 0, 0, 0, 0, 0},
            {502, 0, 0, 0, 0, 0, 0, 0, 0},
            {503, 0, 0, 0, 0, 0, 0, 0, 0},
            {504, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE51 = {
            {510, 0, 0, 0, 0, 0, 0, 0, 0},
            {511, 0, 0, 0, 0, 0, 0, 0, 0},
            {512, 0, 0, 0, 0, 0, 0, 0, 0},
            {513, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE52 = {
            {520, 0, 0, 0, 0, 0, 0, 0, 0},
            {521, 0, 0, 0, 0, 0, 0, 0, 0},
            {522, 0, 0, 0, 0, 0, 0, 0, 0},
            {523, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE53 = {
            {530, 0, 0, 0, 0, 0, 0, 0, 0},
            {531, 0, 0, 0, 0, 0, 0, 0, 0},
            {532, 0, 0, 0, 0, 0, 0, 0, 0},
            {533, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE54 = {
            {540, 0, 0, 0, 0, 0, 0, 0, 0},
            {541, 0, 0, 0, 0, 0, 0, 0, 0},
            {542, 0, 0, 0, 0, 0, 0, 0, 0},
            {543, 0, 0, 0, 0, 0, 0, 0, 0},
            {544, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE55 = {
            {550, 0, 0, 0, 0, 0, 0, 0, 0},
            {551, 0, 0, 0, 0, 0, 0, 0, 0},
            {552, 0, 0, 0, 0, 0, 0, 0, 0},
            {553, 0, 0, 0, 0, 0, 0, 0, 0},
            {554, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE56 = {
            {560, 0, 0, 0, 0, 0, 0, 0, 0},
            {561, 0, 0, 0, 0, 0, 0, 0, 0},
            {562, 0, 0, 0, 0, 0, 0, 0, 0},
            {563, 0, 0, 0, 0, 0, 0, 0, 0},
            {564, 0, 0, 0, 0, 0, 0, 0, 0},
            {565, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE57 = {
            {570, 0, 0, 0, 0, 0, 0, 0, 0},
            {571, 0, 0, 0, 0, 0, 0, 0, 0},
            {572, 0, 0, 0, 0, 0, 0, 0, 0},
            {573, 0, 0, 0, 0, 0, 0, 0, 0},
            {574, 0, 0, 0, 0, 0, 0, 0, 0},
            {575, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE58 = {
            {580, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE59 = {
            {590, 0, 0, 0, 0, 0, 0, 0, 0}
    };
    private final static Integer[][] CHALLENGE60 = {
            {600, 0, 0, 0, 0, 0, 0, 0, 0}
    };

    static {
        CHALLENGES.add(CHALLENGE1);
        CHALLENGES.add(CHALLENGE2);
        CHALLENGES.add(CHALLENGE3);
        CHALLENGES.add(CHALLENGE4);
        CHALLENGES.add(CHALLENGE5);
        CHALLENGES.add(CHALLENGE6);
        CHALLENGES.add(CHALLENGE7);
        CHALLENGES.add(CHALLENGE8);
        CHALLENGES.add(CHALLENGE9);
        CHALLENGES.add(CHALLENGE10);
        CHALLENGES.add(CHALLENGE11);
        CHALLENGES.add(CHALLENGE12);
        CHALLENGES.add(CHALLENGE13);
        CHALLENGES.add(CHALLENGE14);
        CHALLENGES.add(CHALLENGE15);
        CHALLENGES.add(CHALLENGE16);
        CHALLENGES.add(CHALLENGE17);
        CHALLENGES.add(CHALLENGE18);
        CHALLENGES.add(CHALLENGE19);
        CHALLENGES.add(CHALLENGE20);
        CHALLENGES.add(CHALLENGE21);
        CHALLENGES.add(CHALLENGE22);
        CHALLENGES.add(CHALLENGE23);
        CHALLENGES.add(CHALLENGE24);
        CHALLENGES.add(CHALLENGE25);
        CHALLENGES.add(CHALLENGE26);
        CHALLENGES.add(CHALLENGE27);
        CHALLENGES.add(CHALLENGE28);
        CHALLENGES.add(CHALLENGE29);
        CHALLENGES.add(CHALLENGE30);
        CHALLENGES.add(CHALLENGE31);
        CHALLENGES.add(CHALLENGE32);
        CHALLENGES.add(CHALLENGE33);
        CHALLENGES.add(CHALLENGE34);
        CHALLENGES.add(CHALLENGE35);
        CHALLENGES.add(CHALLENGE36);
        CHALLENGES.add(CHALLENGE37);
        CHALLENGES.add(CHALLENGE38);
        CHALLENGES.add(CHALLENGE39);
        CHALLENGES.add(CHALLENGE40);
        CHALLENGES.add(CHALLENGE41);
        CHALLENGES.add(CHALLENGE42);
        CHALLENGES.add(CHALLENGE43);
        CHALLENGES.add(CHALLENGE44);
        CHALLENGES.add(CHALLENGE45);
        CHALLENGES.add(CHALLENGE46);
        CHALLENGES.add(CHALLENGE47);
        CHALLENGES.add(CHALLENGE48);
        CHALLENGES.add(CHALLENGE49);
        CHALLENGES.add(CHALLENGE50);
        CHALLENGES.add(CHALLENGE51);
        CHALLENGES.add(CHALLENGE52);
        CHALLENGES.add(CHALLENGE53);
        CHALLENGES.add(CHALLENGE54);
        CHALLENGES.add(CHALLENGE55);
        CHALLENGES.add(CHALLENGE56);
        CHALLENGES.add(CHALLENGE57);
        CHALLENGES.add(CHALLENGE58);
        CHALLENGES.add(CHALLENGE59);
        CHALLENGES.add(CHALLENGE60);
    }

    public static List<Integer> gateStars = new ArrayList<Integer>();

    public static boolean isLasterSmallGate(int nextGateNum) {
        return nextGateNum == 12 || nextGateNum == 24 || nextGateNum == 36 || nextGateNum == 48 || nextGateNum == 60;
    }
}
